// Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
//  456 -> 5
//  782 -> 8
//  918 -> 1
// div -неполное частное (целое ) -----/
// mod -остаток от деления ---%

int value = 456 ;

//int result = ( value / 10) % 10 ;
Console.WriteLine((456 / 10) % 10 ) ;